src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Параметры:
//  номенклатураСсылка - СправочникСсылка.Номенклатура
//  период - Дата, МоментВремени, Граница
// Возвращаемое значение:
//  - Число - Актуальная цена `номенклатуры` на `период`
//  - Неопределено
Функция ПолучитьЦенуНоменклатуры(Знач номенклатураСсылка, Знач период) Экспорт
    запрос = Новый Запрос;
    запрос.УстановитьПараметр("Период", период);
    запрос.УстановитьПараметр("Номенклатура", номенклатураСсылка);
    запрос.Текст =
        "ВЫБРАТЬ
        |	ЦеныНоменклатурыСрезПоследних.Сумма КАК Сумма
        |ИЗ
        |	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
        |";

    результатЗапроса = запрос.Выполнить();
    Если результатЗапроса.Пустой() Тогда
        Возврат Неопределено;
    КонецЕсли;

    таблицаЦен = результатЗапроса.Выгрузить();
    Возврат таблицаЦен[0].Сумма;
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
